Repository: VikramMSingh/Phrasn
Catalog: scripts/app/translations/ha/LC_MESSAGES/messages.po
Languages: ha

source: Language
ha: Harshe

source: Logout
ha: Fita

source: New Chat
ha: Sabon Tattaunawa

source: PhrasnAI Chat
ha: Tattaunawar PhrasnAI

source: Choose a subject...
ha: Zaɓi wani batu...

source: Math
ha: Lissafi

source: Physics
ha: Kimiyyar Lissafi

source: History
ha: Tarihi

source: Chemistry
ha: Kimiyyar Sinadarai

source: Computer Science
ha: Kimiyyar Kwamfuta

source: Biology
ha: Kimiyyar Halittu

source: General Knowledge
ha: Sanin Gaba ɗaya

source: Type your question here...
ha: Shigar da tambayarka a nan...

source: Language switching instructions:
ha: Umarnin sauya harshe:

source: Mac: Press Control + Option + Space
ha: Mac: Danna Control + Option + Space

source: Windows: Press Windows key + Space
ha: Windows: Danna maɓallin Windows + Space

source: Android: Tap the globe icon on the keyboard
ha: Android: Danna alamar duniya a kan madannin rubutu

source: Sorry, an error occurred. Please try again.
ha: Yi haƙuri, kuskure ya faru. Da fatan za a sake gwadawa.

source: Home
ha: Gida

source: Language and Eductation level
ha: Harshe da Matakin Ilimi

source: Education Level
ha: Matakin Ilimi

source: Middle School
ha: Makarantar Sakandare

source: High School
ha: Babban Makaranta

source: University
ha: Jami'a

source: Preferred Language
ha: Harshe da aka fi so

source: English
ha: Turanci

source: Spanish
ha: Sifaniyanci

source: French
ha: Faransanci

source: German
ha: Jamusanci

source: Chinese
ha: Sinanci

source: Hindi
ha: Harshen Hindi

source: Amharic
ha: Amharik

source: Arabic
ha: Larabci

source: Indonesian
ha: Indonesiyanci

source: Submit
ha: Aika

source: Chat Window
ha: Taga Tattaunawa

source: Hello, World!
ha: Sannu, Duniya!
